// Ведучий вирішив трохи змінити правила попередньої розваги. Молодята обирають число step, і тепер тост промовляє не кожен гість, а лише перший і кожен наступний, який приходить через обрану кількість гостей. Наприклад:

// якщо step = 1, то, як і раніше, тост говорить кожен гість;
// якщо step = 2, то 1-ий, 3-ій, 5-ий ...
// якщо step = 3, то 1, 4, 7, 10 ...
// Напиши функцію getDrinksWithStep, яка приймає numberOfGuests і step та повертає кількість чарок, яку треба підготувати для конкурса.

// Як і раніше, пропонуємо використати цикл for, але з іншим кроком (як це зробити, підкаже перший приклад секції Перебір з іншими параметрами в теорії під відео).
  
  

  
  function getDrinksWithStep(numberOfGuests, step) {
    // write code here
  let count=0;
  for (let i=1; i<=numberOfGuests; i+=step){
     count+=i;
    // return count;
  }
  console.log(count)
   return count;
      
  }
  getDrinksWithStep(10, 3) //=== 22  (1 + 4 + 7 + 10);
  getDrinksWithStep(0) //=== 0 // нема гостей - нема випивки;
  getDrinksWithStep(5, 3) //=== 5 // (1 + 4);
  getDrinksWithStep(18, 10) //=== 12 // (1 + 11);
  
  
  