// В Mate bank є можливість покласти гроші на депозит під певний відсоток і отримати прибуток через деякий час.

// Наприклад, якщо покласти 10000 на 3 роки під 4% річних, отримаємо:

// Перший рік: 10000 + 4% = 10400 // 10000 + 10000 * 0.04
// Другий рік: 10400 + 4% = 10816 // 10400 + 10400 * 0.04
// Третій рік: 10816 + 4% = 11248.64 // 10816 + 10816 * 0.04

// Чистий прибуток = 11248.64 - 10000 = 1248.64
// Напиши функцію calculateProfit, яка приймає три параметри:

// amount - початкова сума, яку ми кладемо на депозит;
// percent - річна відсоткова ставка;
// period - кількість років (час, на який гроші кладуться на депозит).
// Функція повинна розрахувати і повернути суму чистого прибутку за весь час.

// Приклади (ми перевіряємо тільки цілу частину):

// calculateProfit(1000, 5, 1) === 50
// calculateProfit(12500, 3, 12) === 5322

  function calculateProfit(amount, percent, period) {
    // write code here
    const percent1=percent/100;
  let result=amount
  let result1=0
  for(let i=1; i<=period;i++){
  
       result=result+result*percent1;
      result1=result-amount
 
  }
  console.log(result1)
  return result1
    
  }
  calculateProfit(1000, 5, 1) //=== 50
  calculateProfit(10000, 4, 3)//===1248.64
 calculateProfit(12500, 3, 12) //=== 5322
