// Напиши функцію getPlan, яка поверне масив з цілями на задану кількість місяців numberOfMonths. Зараз ми виготовляємо startProduction роботів на місяць і хочемо, щоб щомісяця це число зростало на заданий відсоток percent.

// Якщо кількість роботів буде не цілою, округли її вниз (Math.floor(value)). Ціль кожного наступного місяця розраховуй відносно попереднього.

// Приклади:

// getPlan(200, 3, 50) === [300, 450, 675]
// getPlan(10, 4, 30) === [13, 16, 20, 26]
// getPlan(1000, 6, 30) === [1300, 1690, 2197, 2856, 3712, 4825]
// Подсказка:

// Створи змінну з поточним виробництвом
// Перебери скільки потрібно місяців
// В циклі збільш поточне виробництво та додай в масив планів
function getPlan(startProduction, numberOfMonths, percent) {
    let sum = startProduction;
    let array = [];
  for (let i = 1; i <= numberOfMonths; i++) {
       sum += Math.floor((sum * percent) / 100);
    array.push(sum);
  }
  console.log(array);
  return array;
}


getPlan(200, 3, 50); //=== [300, 450, 675]
getPlan(10, 4, 30); // === [13, 16, 20, 26]
getPlan(1000, 6, 30); // === [1300, 1690, 2197, 2856, 3712, 4825]
